app/controllers/api/users_controller.rb

    def create
      user = User.new(user_params)
      if user.save
---
INSERT INTO "vuln_scanner"."users" ("name", "email_address", "password_digest", "org_id", "access_level", "is_active", "created_at", "updated_at") VALUES ('My Name', 'my.email@email.com', '$2a$12$vNytXAr5yc.aPK2yDGnG8etM8M6RREAiaU9ydFNTHaj3JzBHX9ksC', 1, 'admin', TRUE, '2026-02-12 02:05:02.503665', '2026-02-12 02:05:02.503665') RETURNING "id", "created_at", "updated_at"

    def signin
      user = User.find_by(email_address: params[:user][:email_address])
---
SELECT "vuln_scanner"."users".* FROM "vuln_scanner"."users" WHERE "vuln_scanner"."users"."email_address" = 'my.email@email.com' LIMIT 1